"""Конфигурационный файл с историческим составом конференций и дивизионов КХЛ."""

from typing import Dict, List

# Это алиасы (наименования) типов конференций и дивизионов для удобства. 
Conference = Dict[str, List[str]]
Division = Dict[str, List[List[str]]]

# Исторические составы конференций
CONFERENCES: Dict[str, Conference] = {
    "khl_2013_14.csv": {
        "Запад": [
            "Динамо М", "ЦСКА", "СКА", "Лев Пр", "Донбасс", "Динамо Р",
            "Медвешчак", "Слован", "Локомотив", "Атлант", "Северсталь", "Витязь",
            "Спартак", "Динамо Мн"
        ],
        "Восток": [
            "Металлург Мг", "Барыс", "Ак Барс", "Салават Юлаев", "Сибирь", "Торпедо НН",
            "Адмирал", "Трактор", "Автомобилист", "Авангард", "Югра", "Нефтехимик",
            "Амур", "Металлург Нк"
        ]
    },
    "khl_2014_15.csv": {
        "Запад": [
            "ЦСКА", "СКА", "Динамо М", "Йокерит", "Динамо Мн", "Локомотив", "Торпедо НН",
            "ХК Сочи", "Северсталь", "Витязь", "Слован", "Медвешчак", "Динамо Р", "Атлант"
        ],
        "Восток": [
            "Ак Барс", "Сибирь", "Металлург Мг", "Авангард", "Салават Юлаев", "Барыс",
            "Автомобилист", "Трактор", "Нефтехимик", "Адмирал", "Лада", "Югра",
            "Амур", "Металлург Нк"
        ]
    },
    "khl_2015_16.csv": {
        "Запад": [
            "ЦСКА", "Йокерит", "Локомотив", "Сочи", "Динамо М", "Торпедо НН", "СКА",
            "Слован", "Динамо Мн", "Спартак", "Медвешчак", "Витязь", "Динамо Р", "Северсталь"
        ],
        "Восток": [
            "Авангард", "Металлург Мг", "Сибирь", "Салават Юлаев", "Ак Барс", "Адмирал",
            "Автомобилист", "Нефтехимик", "Барыс", "Трактор", "Югра", "Амур",
            "Лада", "Металлург Нк"
        ]
    },
    "khl_2016_17.csv": {
        "Запад": [
            "ЦСКА", "СКА", "Торпедо НН", "Локомотив", "Динамо М", "Динамо Мн", "Йокерит",
            "Витязь", "Сочи", "Спартак", "Слован", "Северсталь", "Медвешчак", "Динамо Р"
        ],
        "Восток": [
            "Металлург Мг", "Авангард", "Ак Барс", "Салават Юлаев", "Трактор", "Сибирь",
            "Адмирал", "Куньлунь РС", "Автомобилист", "Нефтехимик", "Барыс", "Югра",
            "Лада", "Амур", "Металлург Нк"
        ]
    },
    "khl_2017_18.csv": {
        "Запад": [
            "СКА", "ЦСКА", "Йокерит", "Локомотив", "Торпедо НН", "ХК Сочи", "Спартак",
            "Северсталь", "Динамо М", "Динамо Мн", "Витязь", "Слован", "Динамо Р"
        ],
        "Восток": [
            "Ак Барс", "Салават Юлаев", "Трактор", "Автомобилист", "Металлург Мг",
            "Нефтехимик", "Авангард", "Амур", "Сибирь", "Барыс", "Адмирал", "Куньлунь РС",
            "Лада", "Югра"
        ]
    }
}

# Исторические составы дивизионов
# TODO: добавить дивизионы
# Исторические составы дивизионов
DIVISIONS: Dict[str, Division] = {
    "khl_2013_14.csv": {
        "Запад": [
            # Дивизион Боброва
            ["СКА", "Лев Пр", "Динамо Р", "Медвешчак", "ЦСКА", "Слован", "Динамо Мн"],
            # Дивизион Тарасова
            ["Динамо М", "Донбасс", "Локомотив", "Атлант", "Северсталь", "Витязь", "Спартак"]
        ],
        "Восток": [
            # Дивизион Харламова (В сезоне 13/14 Торпедо НН играло на Востоке)
            ["Металлург Мг", "Ак Барс", "Торпедо НН", "Трактор", "Автомобилист", "Нефтехимик", "Югра"],
            # Дивизион Чернышева
            ["Барыс", "Салават Юлаев", "Сибирь", "Адмирал", "Авангард", "Металлург Нк", "Амур"]
        ]
    },
    "khl_2014_15.csv": {
        "Запад": [
            # Дивизион Боброва
            ["СКА", "Йокерит", "Динамо Мн", "Слован", "Медвешчак", "Динамо Р", "Атлант"],
            # Дивизион Тарасова (Торпедо НН перевели на Запад, добавился ХК Сочи)
            ["ЦСКА", "Динамо М", "Локомотив", "Торпедо НН", "ХК Сочи", "Северсталь", "Витязь"]
        ],
        "Восток": [
            # Дивизион Харламова (добавилась Лада)
            ["Ак Барс", "Металлург Мг", "Автомобилист", "Трактор", "Нефтехимик", "Лада", "Югра"],
            # Дивизион Чернышева
            ["Сибирь", "Авангард", "Салават Юлаев", "Барыс", "Адмирал", "Амур", "Металлург Нк"]
        ]
    },
    "khl_2015_16.csv": {
        "Запад": [
            # Дивизион Боброва (вернулся Спартак, ушел Атлант)
            ["Йокерит", "СКА", "Слован", "Динамо Мн", "Спартак", "Медвешчак", "Динамо Р"],
            # Дивизион Тарасова (в этом сезоне название Сочи пишется без "ХК")
            ["ЦСКА", "Локомотив", "Сочи", "Динамо М", "Торпедо НН", "Витязь", "Северсталь"]
        ],
        "Восток": [
            # Дивизион Харламова
            ["Металлург Мг", "Ак Барс", "Автомобилист", "Нефтехимик", "Трактор", "Югра", "Лада"],
            # Дивизион Чернышева
            ["Авангард", "Сибирь", "Салават Юлаев", "Адмирал", "Барыс", "Амур", "Металлург Нк"]
        ]
    },
    "khl_2016_17.csv": {
        "Запад": [
            # Дивизион Боброва
            ["Динамо Мн", "Йокерит", "Слован", "Медвешчак", "Динамо Р", "Спартак", "СКА"],
            # Дивизион Тарасова
            ["ЦСКА", "Торпедо НН", "Локомотив", "Динамо М", "Витязь", "Сочи", "Северсталь"]
        ],
        "Восток": [
            # Дивизион Харламова (8 команд в сезоне 16/17)
            ["Металлург Мг", "Ак Барс", "Трактор", "Автомобилист", "Нефтехимик", "Югра", "Лада", "Металлург Нк"],
            # Дивизион Чернышева (добавился Куньлунь РС, 7 команд)
            ["Авангард", "Салават Юлаев", "Сибирь", "Адмирал", "Куньлунь РС", "Барыс", "Амур"]
        ]
    },
    "khl_2017_18.csv": {
        "Запад": [
            # Дивизион Боброва
            ["СКА", "Йокерит", "Спартак", "Динамо Мн", "Слован", "Динамо Р"],
            # Дивизион Тарасова (в этом сезоне название Сочи пишется как "ХК Сочи")
            ["ЦСКА", "Локомотив", "Торпедо НН", "ХК Сочи", "Северсталь", "Динамо М", "Витязь"]
        ],
        "Восток": [
            # Дивизион Харламова
            ["Ак Барс", "Трактор", "Автомобилист", "Металлург Мг", "Нефтехимик", "Лада", "Югра"],
            # Дивизион Чернышева
            ["Салават Юлаев", "Авангард", "Амур", "Сибирь", "Барыс", "Адмирал", "Куньлунь РС"]
        ]
    }
}
